# IEntryPoint Methods

---
The IEntryPoint type exposes the following members.
| Name| Description
---|---|---
| FinishInitialization|
| Initialize|
| OnShutdown|
Top
#### Reference
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace